-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jun 24, 2023 at 05:47 PM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 8.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `roomdb`
--

-- --------------------------------------------------------

--
-- Table structure for table `room_about`
--

CREATE TABLE `room_about` (
  `id` varchar(36) NOT NULL,
  `room` varchar(120) NOT NULL,
  `descript` text NOT NULL,
  `img` text NOT NULL,
  `desc_type` varchar(24) NOT NULL,
  `status` varchar(250) NOT NULL,
  `created` varchar(36) NOT NULL,
  `modified` varchar(36) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `room_about`
--

INSERT INTO `room_about` (`id`, `room`, `descript`, `img`, `desc_type`, `status`, `created`, `modified`) VALUES
('r0001', 'standard', 'ห้องพักที่มีขนาดและการตกแต่งตามมาตรฐานทั่วไป มีสิ่งอำนวยความสะดวกเท่าที่จำเป็น', '', 'room', 'off', '2023-05-05 04:58', '2023-06-24 22:44:21'),
('r0002', 'superior', 'เป็นห้องที่มีลักษณะคล้ายกับห้อง Standard แต่มีขนาดห้องกว้างกว่าเล็กน้อย ทัศนียภาพดีกว่าและอาจมีสิ่งอำนวยความสะดวกเพิ่มขึ้นมา 1-2 ชิ้น', '', 'room', 'off', '2023-05-05 04:59', '2023-06-24 22:44:24'),
('r0003', 'deluxe', 'ขนาดห้องอาจเท่าหรือกว้างกว่าห้อง Standard แต่มีการตกแต่งสวยงามเป็นพิเศษ ให้ความรู้สึกหรูหรามีเตียงขนาดใหญ่เป็นพิเศษ มีสิ่งอำนวยความสะดวกครบครันและยังสามารถมองเห็นวิวในมุมที่สวยที่สุดของโรงแรม', '', 'room', 'off', '2023-05-05 04:59', '2023-06-03 19:41:27'),
('r0004', 'suite', 'เป็นห้องที่มีส่วนของห้องนั่งเล่นอยู่ด้วย มีการแบ่งสัดส่วนที่ชัดเจนครบครันด้วยเฟอร์นิเจอร์และสิ่งอำนวยความสะดวก ทำให้ห้องประเภทนี้มีขนาดกว้างกว่าห้องประเภทอื่นและมีการตกแต่งที่หรูหรา เหมาะสำหรับผู้เข้าพักเป็นครอบครัวหรือคู่รัก', '', 'room', 'off', '2023-05-05 04:59', '2023-06-17 16:06:20'),
('r0005', 'family', 'ห้องพักที่เหมาะสำหรับครอบครัวหรือกลุ่มเพื่อน มีเตียงหลายหลังอยู่ภายในห้อง ส่วนมากจะพักได้ไม่เกิน4-6 ท่าน', '', 'room', 'off', '2023-05-05 05:00', '2023-06-17 16:06:22'),
('r0006', 'studio', 'ห้องพักขนาดใหญ่ อารมณ์เหมือนคอนโด มีการแบ่งสัดส่วนของห้องชัดเจน แยกห้องนั่งเล่นออกจากห้องนอนอาจมีบริเวณครัวเล็กๆที่สามารถประกอบอาหารภายในห้องพักได้', '', 'room', 'off', '2023-05-05 05:00', '2023-05-05 08:10:35'),
('r0007', 'connecting', 'ห้องพักที่มีประตูเชื่อมต่อไปยังอีกห้องหนึ่งที่ติดกันได้ สามารถเปิดถึงกันได้', '', 'room', 'off', '2023-05-05 05:01', '2023-06-17 16:06:25'),
('r0008', 'cabana', 'ห้องที่อยู่ระดับพื้นดิน หรือใกล้สระว่ายน้ำ หรือชายหาด', '', 'room', 'off', '2023-05-05 05:01', '2023-05-10 07:06:33'),
('r0009', 'duplex', 'ห้องพักมีสองชั้น อาจจะแบ่งเป็นห้องนั่งเล่นห้องครัวชั้นนึง ส่วนอีกชั้นเป็นห้องนอน ขนาดห้องเกิน 100 ตารางเมตรขึ้นไป เหมาะกับการพักผ่อนยาวๆกับครอบครัวใหญ่ที่มีสมาชิกหลายคน', '', 'room', 'off', '2023-05-05 05:01', '2023-06-16 18:24:49'),
('r0010', 'villa', 'ลักษณะเป็นบ้านพัก มีบริเวณบ้าน มีสวน ลานจอดรถ เหมือนบ้านที่อยู่อาศัย ส่วนมากมักมีเพียง 1 ห้องนอน', '', 'room', 'off', '2023-05-05 05:03', '2023-06-17 16:06:28'),
('r0011', 'adjoining', 'ห้องพัก 2 ห้อง ที่อยู่ติดกัน', '', 'room', 'off', '2023-05-05 05:04', '2023-05-05 05:04'),
('r0012', 'honeymoon', 'ห้องสำหรับคู่รัก จะมีเตียงนอนขนาดใหญ่สำหรับ 2 คน มีสิ่งอำนวยความสะดวก และการตกแต่งช่วยเพิ่มบรรยากาศดีๆ ให้กับคู่รักมากกว่าห้องพักมาตรฐานทั่วไป', '', 'room', 'off', '2023-05-05 05:04', '2023-05-05 05:04'),
('r0013', 'king-sized', 'ห้องขนาดใหญ่ เตียงมีขนาดใหญ่ 6x6 ฟุต แจ้งเพิ่มเตียงเสริมได้โดยจ่ายค่าธรรมเนียมเพิ่ม', '', 'bed', 'off', '2023-05-05 05:04', '2023-05-05 05:04'),
('r0014', 'queen-sized', 'ห้องขนาดรองลงมา เตียงมีขนาดกลาง 5x6 ฟุต แจ้งเพิ่มเตียงเสริมได้โดยจ่ายค่าธรรมเนียมเพิ่ม', '', 'bed', 'off', '2023-05-05 05:04', '2023-05-05 05:04'),
('r0015', 'single-bed', 'ห้องเตียงเดี่ยว รองรับผู้เข้าพัก 1 คน มีหนึ่งเตียงขนาด 3x6 ฟุต สามารถเพิ่มเตียงเสริมได้ เรียกว่า Extra bed ต้องจ่ายค่าธรรมเนียมเพิ่ม ขนาดห้องโดยทั่วไปอยู่ระหว่าง 37-45 ตารางเมตร', '', 'bed', 'off', '2023-05-05 05:04', '2023-05-05 05:05'),
('r0016', 'twin-bed', ' ห้องทวินหรือห้องเตียงคู่ รองรับผู้เข้าพัก 1-2 คน จะมีเตียงเดี่ยวขนาด 3x6 ฟุต 2 เตียงสามารถเพิ่มเตียงเสริมได้โดยจ่ายค่าธรรมเนียมเพิ่ม ขนาดห้องโดยทั่วไปอยู่ระหว่าง 32-40 ตารางเมตร', '', 'bed', 'off', '2023-05-05 05:05', '2023-05-05 05:05'),
('r0017', 'double-bed', ' ห้องเตียงคู่ รองรับผู้เข้าพัก 2 คน มีเตียงใหญ่ 1 เตียง ขนาด 4.5x6 ฟุต สามารถแจ้งเพิ่มเตียงเสริมได้โดยจ่ายค่าธรรมเนียมเพิ่ม ขนาดห้องโดยทั่วไปอยู่ระหว่าง 40-45 ตารางเมตร', '', 'bed', 'off', '2023-05-05 05:05', '2023-05-05 05:05'),
('r0018', 'triple-bed', ' ห้องที่สามารถรองรับผู้เข้าพักได้ 3 คน มี 3 เตียงเดี่ยว หรือมีเตียงคู่ 1 เตียง และเตียงเดี่ยว 1 เตียง ขนาดห้องโดยทั่วไปอยู่ระหว่าง 45-65 ตารางเมตร', '', 'bed', 'off', '2023-05-05 05:05', '2023-05-07 00:20:44'),
('r0019', 'quad-bed', 'ห้องที่รองรับผู้เข้าพักได้ 4 คน อาจมี 2 เตียงหรือมากว่า ขนาดห้องโดยทั่วไปอยู่ระหว่าง 70-85 ตารางเมตร', '', 'bed', 'off', '2023-05-05 05:05', '2023-05-05 05:05'),
('r0020', 'garden-view', 'เป็นห้องที่มองเห็นวิวสวน ซึ่งส่วนใหญ่จะอยู่ห่างจากทะเลที่สุด แต่ร่มรื่นไปด้วยบรรยากาศของส่วน หรือต้นไม้', '', 'view', 'off', '2023-05-05 05:05', '2023-05-05 05:06'),
('r0021', 'seaview', 'เป็นห้องพักที่มองเห็นวิวทะเล โดยอาจจะมีทั้งห้อง ซึ่งส่วนใหญ่จะเป็นห้องใหญ่', '', 'view', 'off', '2023-05-05 05:06', '2023-05-05 05:06'),
('r0022', 'poolview', 'เป็นห้องที่มองเห็นสระน้ำ แต่ไม่สามารถเดินลงสระน้ำได้เลย', '', 'view', 'off', '2023-05-05 05:06', '2023-05-05 05:06'),
('r0023', 'pool-access', 'เป็นห้องที่หลังห้องติดกับสระนำ สามารถเดินลงสระได้เลย เหมาะกับกลุ่มเพื่อนฝูงที่อยากมีปาร์ตี้ริมสระ แต่ไม่ค่อยแนะนำสำหรับท่านที่อยากได้ความเป็นส่วนตัว เพราะสระว่ายน้ำรวมอาจจะมีแขกท่านอื่นใช้บริการได้ตลอดเวลา', '', 'view', 'off', '2023-05-05 05:06', '2023-05-06 02:06:12'),
('r0024', 'beach-front', 'เป็นห้องติดหาด ส่วนใหญ่แล้วจะมีจำนวนห้องไม่มาก ท่านใดที่อยากตื่นมานอนเห็นชายหาดต้องรีบสำรองห้องแบบนี้ไว้ก่อน เพราะปกติจะเต็มเร็วที่สุด', '', 'view', 'off', '2023-05-05 05:07', '2023-05-05 05:07');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `room_about`
--
ALTER TABLE `room_about`
  ADD PRIMARY KEY (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
